RT-Thread/rt-thread/bsp/at32/libraries/AT32F45x_Firmware_Library/drivers/src/at32f45x_can.c
  can_bittime_struct->bittime_div = 1;

  can_bittime_struct->ac_bts1_size = 12;
  can_bittime_struct->ac_bts2_size = 4;
  can_bittime_struct->ac_rsaw_size = 4;

#ifdef SUPPORT_CAN_FD
  can_bittime_struct->fd_bts1_size = 6;
  can_bittime_struct->fd_bts2_size = 2;
  can_bittime_struct->fd_rsaw_size = 2;
  can_bittime_struct->fd_ssp_offset = 7;
#endif
}

/**
  * @brief  set the bittime of the can peripheral.
  * @param  can_x: select the can peripheral.
  *         this parameter can be one of the following values:
  *         CAN1, CAN2, CAN3.
  * @param  can_bittime_struct: pointer to a can_bittime_type structure which will be set.
  * @note   baudrate calculate method is:
  *         baudrate = can_clk/(baudrate_div *(bts1_size + bts2_size))
  * @retval none
  */
void can_bittime_set(can_type* can_x, can_bittime_type* can_bittime_struct)
{
  can_x->lbtcfg_bit.presc = can_bittime_struct->bittime_div - 1;

  can_x->actime_bit.ac_seg_1 = can_bittime_struct->ac_bts1_size-2;
  can_x->actime_bit.ac_seg_2 = can_bittime_struct->ac_bts2_size-1;
  can_x->actime_bit.ac_sjw = can_bittime_struct->ac_rsaw_size-1;

#ifdef SUPPORT_CAN_FD
  can_x->fdtime_bit.fd_seg_1 = can_bittime_struct->fd_bts1_size-2;
  can_x->fdtime_bit.fd_seg_2 = can_bittime_struct->fd_bts2_size-1;
  can_x->fdtime_bit.fd_sjw = can_bittime_struct->fd_rsaw_size-1;
  can_x->lbtcfg_bit.fd_sspoff = can_bittime_struct->fd_ssp_offset;
#endif
}

/**
  * @brief  set the retransmission limit value of the can peripheral.
  * @param  can_x: select the can peripheral.
  *         this parameter can be one of the following values:
  *         CAN1, CAN2, CAN3.
  * @param  re_trans_times: can re-transmission times type.
  *         this parameter can be one of the following values:
  *         - CAN_RE_TRANS_TIMES_0
  *         - CAN_RE_TRANS_TIMES_1
  *         - CAN_RE_TRANS_TIMES_2
  *         - CAN_RE_TRANS_TIMES_3
  *         - CAN_RE_TRANS_TIMES_4
  *         - CAN_RE_TRANS_TIMES_5
  *         - CAN_RE_TRANS_TIMES_6
  *         - CAN_RE_TRANS_TIMES_UNLIMIT
  * @retval none
  */
void can_retransmission_limit_set(can_type* can_x, can_retransmission_times_type re_trans_times)
{
  can_x->lbtcfg_bit.retlim = re_trans_times;
}

/**
  * @brief  set the re-arbitration limit value of the can peripheral.
  * @param  can_x: select the can peripheral.
  *         this parameter can be one of the following values:
  *         CAN1, CAN2, CAN3.
  * @param  re_arbi_times: can re-arbitration times type.
  *         this parameter can be one of the following values:
  *         - CAN_RE_ARBI_TIMES_0
  *         - CAN_RE_ARBI_TIMES_1
  *         - CAN_RE_ARBI_TIMES_2
  *         - CAN_RE_ARBI_TIMES_3
  *         - CAN_RE_ARBI_TIMES_4
  *         - CAN_RE_ARBI_TIMES_5
  *         - CAN_RE_ARBI_TIMES_6
  *         - CAN_RE_ARBI_TIMES_UNLIMIT
  * @retval none
  */
void can_rearbitration_limit_set(can_type* can_x, can_rearbitration_times_type re_arbi_times)
{
  can_x->lbtcfg_bit.realim = re_arbi_times;
}

/**
  * @brief  enable time-stamping of the can peripheral.
  * @param  can_x: select the can peripheral.
  *         this parameter can be one of the following values:
  *         CAN1, CAN2, CAN3.
  * @param  new_state: new state of the can time-stamping.
  *         this parameter can be: TRUE or FALSE.
  * @retval none
  */
void can_timestamp_enable(can_type* can_x, confirm_state new_state)
{
  can_x->tncfg_bit.tsen = new_state;
}

/**
  * @brief  set time-stamping position of the can peripheral.
  * @param  can_x: select the can peripheral.
  *         this parameter can be one of the following values:
  *         CAN1, CAN2, CAN3.
  * @param  timestamp_position: can timestamp position type.
  *         this parameter can be one of the following values:
  *         - CAN_TIMESTAMP_AT_SOF
  *         - CAN_TIMESTAMP_AT_EOF
  * @retval none
  */
void can_timestamp_position_set(can_type* can_x, can_timestamp_position_type timestamp_position)
{
  can_x->tncfg_bit.tspos = timestamp_position;
}

/**
  * @brief  return the transmission timestamp of the specified can peripheral.
  * @param  can_x: select the can peripheral.
  *         this parameter can be one of the following values:
  *         CAN1, CAN2, CAN3.
  * @retval the value of transmission timestamp.
  */
uint32_t can_transmit_timestamp_get(can_type* can_x)
{
  return (uint32_t)can_x->tts;
}

/**
  * @brief  write the transmission buffer of the can peripheral.
  * @param  can_x: select the can peripheral.
  *         this parameter can be one of the following values:
  *         CAN1, CAN2, CAN3.
  * @param  txbuf_type: txbuf select type
  *         this parameter can be one of the following values:
  *         - CAN_TXBUF_PTB
  *         - CAN_TXBUF_STB
  * @param  can_txbuf_struct: pointer to a structure which contains the buffer to be trans.
  * @retval SUCCESS or ERROR
  */
error_status can_txbuf_write(can_type* can_x, can_txbuf_select_type txbuf_type, can_txbuf_type* can_txbuf_struct)
{
#ifdef SUPPORT_CAN_FD
  uint8_t len = dlc_to_bytes[can_txbuf_struct->data_length];
#else
  uint8_t len = can_txbuf_struct->data_length;
#endif
  uint32_t* wp = (uint32_t*)can_x->tbdat;
  uint8_t* rp = can_txbuf_struct->data;
  uint8_t byte_cnt;

  uint8_t* reg;
  uint8_t tmp;

  switch(txbuf_type)
  {
    case CAN_TXBUF_PTB:
      if(can_x->ctrlstat_bit.tpe == TRUE)
      {
        /* if tpe=1 then the primary transmit buffer is write-locked. */
        return ERROR;
      }
      break;
    case CAN_TXBUF_STB:
      if(can_x->ctrlstat_bit.tsnext == TRUE)
      {
        /* while tsnext=1, then writing to the secondary transmit buffer is blocked. */
        return ERROR;
      }
      break;
    default:
      return ERROR;
  }

  /* write tbsel, avoid duplicate setting these bits(tsa, tsall, tsone, tpa, tpe and tbsel). */
  reg = (uint8_t*)&can_x->ctrlstat + 1;
  tmp = *reg & 0x60;
  *reg = tmp | (txbuf_type<<7);

  switch(can_txbuf_struct->id_type)
  {
    case CAN_ID_STANDARD:
      can_x->tbid = (0x7FF & can_txbuf_struct->id)<<18;
      break;
    case CAN_ID_EXTENDED:
      can_x->tbid = (0x1FFFFFFF & can_txbuf_struct->id);
      break;
    default:
      return ERROR;
  }
  can_x->tbid |= (can_txbuf_struct->tx_timestamp << 31);

