RT-Thread/rt-thread/bsp/at32/libraries/AT32F45x_Firmware_Library/drivers/src/at32f45x_can.c
  can_x->tbfmt = 0;
  can_x->tbfmt_bit.ide = can_txbuf_struct->id_type;
  can_x->tbfmt_bit.rmf = can_txbuf_struct->frame_type;
  can_x->tbfmt_bit.dlc = can_txbuf_struct->data_length;
#ifdef SUPPORT_CAN_FD
  can_x->tbfmt_bit.brs = can_txbuf_struct->fd_rate_switch;
  can_x->tbfmt_bit.fdf = can_txbuf_struct->fd_format;
#endif

  /* write tx payload to the message ram */
  for (byte_cnt = 0; byte_cnt < len; byte_cnt += 4U)
  {
    *wp++ = (((uint32_t)rp[byte_cnt + 3U] << 24U) |
             ((uint32_t)rp[byte_cnt + 2U] << 16U) |
             ((uint32_t)rp[byte_cnt + 1U] << 8U)  |
              (uint32_t)rp[byte_cnt]);
  }

  can_x->tbtyp = 0;
  can_x->tbtyp_bit.handle = can_txbuf_struct->handle;
  can_x->reserved8 = 0;

  /* the buffer slot selected by tbptr shall be marked as filled. */
  can_x->ttcfg_bit.tbf = TRUE;

  return SUCCESS;
}

/**
  * @brief  set transmit trigger txbuf slot pointer for ttcan.
  * @param  can_x: select the can peripheral.
  *         this parameter can be one of the following values:
  *         CAN1, CAN2, CAN3.
  * @param  txbuf_number: pointer to a txbuf frame slot.
  *         this parameter can be one of the following values:
  *         - CAN_TTCAN_TXBUF_NUM_0
  *         - CAN_TTCAN_TXBUF_NUM_1
  *         - CAN_TTCAN_TXBUF_NUM_2
  *         - CAN_TTCAN_TXBUF_NUM_3
  * @retval none
  */
void can_ttcan_txbuf_transmit_set(can_type* can_x,  can_ttcan_txbuf_type txbuf_number)
{
  can_x->ttcfg_bit.ttptr = txbuf_number;
}

/**
  * @brief  set transmit enable window for ttcan.
  *         for a single shot transmit trigger there is a time of up to 16 ticks of the cycle time where the frame is allowed to start.
  * @param  can_x: select the can peripheral.
  *         this parameter can be one of the following values:
  *         CAN1, CAN2, CAN3.
  * @param  window_ticks: transmit enable window. window_ticks+1 defines the number of ticks.
  *         this parameter can be 0~15.
  * @retval none
  */
void can_ttcan_transmit_window_set(can_type* can_x, uint8_t window_ticks)
{
  can_x->ttcfg_bit.tew = window_ticks;
}

/**
  * @brief  enable or disable the interrupt of the specified can peripheral.
  * @param  can_x: select the can peripheral.
  *         this parameter can be one of the following values:
  *         CAN1, CAN2, CAN3.
  * @param  can_int: specifies the can interrupt sources to be enabled or disabled.
  *         this parameter can be one of the following values:
  *         - CAN_AIE_INT
  *         - CAN_EIE_INT
  *         - CAN_TSIE_INT
  *         - CAN_TPIE_INT
  *         - CAN_RAFIE_INT
  *         - CAN_RFIE_INT
  *         - CAN_ROIE_INT
  *         - CAN_RIE_INT
  *         - CAN_BEIE_INT
  *         - CAN_ALIE_INT
  *         - CAN_EPIE_INT
  *         - CAN_TTIE_INT
  *         - CAN_TEIF_FLAG
  *         - CAN_WTIE_INT
  *         - CAN_ALL_INT
  * @param  new_state: new state of the can interrupts.
  *         this parameter can be: TRUE or FALSE.
  * @retval none.
  */
void can_interrupt_enable(can_type* can_x, uint32_t can_int, confirm_state new_state)
{
  if (new_state != FALSE)
  {
    can_x->inten |= can_int;
  }
  else
  {
    can_x->inten &= ~can_int;
  }
}

/**
  * @brief  get flag of the specified can peripheral.
  * @param  can_x: select the can peripheral.
  *         this parameter can be one of the following values:
  *         CAN1, CAN2, CAN3.
  * @param  can_flag: select the flag.
  *         this parameter can be one of the following flags:
  *         - CAN_AIF_FLAG
  *         - CAN_EIF_FLAG
  *         - CAN_TSIF_FLAG
  *         - CAN_TPIF_FLAG
  *         - CAN_RAFIF_FLAG
  *         - CAN_RFIF_FLAG
  *         - CAN_ROIF_FLAG
  *         - CAN_RIF_FLAG
  *         - CAN_BEIF_FLAG
  *         - CAN_ALIF_FLAG
  *         - CAN_EPIF_FLAG
  *         - CAN_TTIF_FLAG
  *         - CAN_TEIF_FLAG
  *         - CAN_WTIE_FLAG
  *         - CAN_EPASS_FLAG
  *         - CAN_EWARN_FLAG
  * @retval status of can flag, the returned value can be: SET or RESET.
  */
flag_status can_flag_get(can_type* can_x, uint32_t can_flag)
{
  flag_status bit_status = RESET;
  if(can_x->sts & can_flag)
  {
    bit_status = SET;
  }
  return bit_status;
}

/**
  * @brief  get interrupt flag of the specified can peripheral.
  * @param  can_x: select the can peripheral.
  *         this parameter can be one of the following values:
  *         CAN1, CAN2, CAN3.
  * @param  can_flag: select the flag.
  *         this parameter can be one of the following flags:
  *         - CAN_AIF_FLAG
  *         - CAN_EIF_FLAG
  *         - CAN_TSIF_FLAG
  *         - CAN_TPIF_FLAG
  *         - CAN_RAFIF_FLAG
  *         - CAN_RFIF_FLAG
  *         - CAN_ROIF_FLAG
  *         - CAN_RIF_FLAG
  *         - CAN_BEIF_FLAG
  *         - CAN_ALIF_FLAG
  *         - CAN_EPIF_FLAG
  *         - CAN_TTIF_FLAG
  *         - CAN_TEIF_FLAG
  *         - CAN_WTIE_FLAG
  * @retval flag_status (SET or RESET)
  */
flag_status can_interrupt_flag_get(can_type* can_x, uint32_t can_flag)
{
  flag_status status = RESET;
  if((can_x->inten & can_flag) && (can_x->sts & can_flag))
  {
    status = SET;
  }
  return status;
}

/**
  * @brief  clear flag of the specified can peripheral.
  * @param  can_x: select the can peripheral.
  *         this parameter can be one of the following values:
  *         CAN1, CAN2, CAN3.
  * @param  can_flag: select the flag.
  *         this parameter can be one of the following flags:
  *         - CAN_AIF_FLAG
  *         - CAN_EIF_FLAG
  *         - CAN_TSIF_FLAG
  *         - CAN_TPIF_FLAG
  *         - CAN_RAFIF_FLAG
  *         - CAN_RFIF_FLAG
  *         - CAN_ROIF_FLAG
  *         - CAN_RIF_FLAG
  *         - CAN_BEIF_FLAG
  *         - CAN_ALIF_FLAG
  *         - CAN_EPIF_FLAG
  *         - CAN_TTIF_FLAG
  *         - CAN_TEIF_FLAG
  *         - CAN_WTIE_FLAG
  *         - CAN_EPASS_FLAG
  *         - CAN_EWARN_FLAG
  *         - CAN_ALL_FLAG
  * @retval none.
  */
void can_flag_clear(can_type* can_x, uint32_t can_flag)
{
  can_x->sts = can_flag;
}

/**
  * @}
  */

#endif

/**
  * @}
  */

/**
  * @}
  */
